#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://terraform.adarshasuvarna.in/app/Niveus-Solutions-Pvt-Ltd/Terraform-GitHub-Action/runs/run-os26bNno6AATtQZV

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.google_kms_key_ring.kms_key_ring["learn-gcpdevops-98765"]: Reading...[0m[0m
[0m[1mdata.google_kms_key_ring.kms_key_ring["learn-gcpdevops-98765"]: Read complete after 1s [id=projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring][0m
[0m[1mdata.google_kms_crypto_key.crypto_key["learn-gcpdevops-98765"]: Reading...[0m[0m
[0m[1mdata.google_kms_crypto_key.crypto_key["learn-gcpdevops-98765"]: Read complete after 0s [id=projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring/cryptoKeys/test][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.cloud_bucket["learn-gcpdevops-98765"].google_storage_bucket.bucket[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket" "bucket" {
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m labels                      = {
          [32m+[0m[0m "app" = "gcs"
          [32m+[0m[0m "env" = "uat"
        }
      [32m+[0m[0m location                    = "ASIA-SOUTH1"
      [32m+[0m[0m name                        = "learn-gcpdevops-98765"
      [32m+[0m[0m project                     = "learn-gcp-devops-adarsh"
      [32m+[0m[0m public_access_prevention    = (known after apply)
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m storage_class               = "STANDARD"
      [32m+[0m[0m uniform_bucket_level_access = true
      [32m+[0m[0m url                         = (known after apply)

      [32m+[0m[0m encryption {
          [32m+[0m[0m default_kms_key_name = "projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring/cryptoKeys/test"
        }

      [32m+[0m[0m lifecycle_rule {
          [32m+[0m[0m action {
              [32m+[0m[0m type = "Delete"
            }
          [32m+[0m[0m condition {
              [32m+[0m[0m age                   = 3
              [32m+[0m[0m matches_prefix        = []
              [32m+[0m[0m matches_storage_class = []
              [32m+[0m[0m matches_suffix        = []
              [32m+[0m[0m with_state            = (known after apply)
            }
        }

      [32m+[0m[0m logging {
          [32m+[0m[0m log_bucket        = "log-bucket"
          [32m+[0m[0m log_object_prefix = (known after apply)
        }

      [32m+[0m[0m versioning {
          [32m+[0m[0m enabled = true
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m bucket_id        = [
      [32m+[0m[0m [90mnull[0m[0m,
    ]
  [32m+[0m[0m bucket_name      = [
      [32m+[0m[0m "learn-gcpdevops-98765",
    ]
  [32m+[0m[0m bucket_self_link = [
      [32m+[0m[0m [90mnull[0m[0m,
    ]
  [32m+[0m[0m bucket_url       = [
      [32m+[0m[0m [90mnull[0m[0m,
    ]

```

</details>

*Pushed by: @Adarsh-Suvarna, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*